In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from XRBID.Sources import LoadSources

I am following this [tutorial](https://www.youtube.com/watch?v=2uvysYbKdjM).

In [2]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], columns=["A", "B", "C"], index=["x", "y", "z", "zz"])

In [3]:
df.head()

     A   B   C
x    1   2   3
y    4   5   6
z    7   8   9
zz  10  11  12

In [4]:
df.head(2)

   A  B  C
x  1  2  3
y  4  5  6

In [5]:
df.index.tolist()

['x', 'y', 'z', 'zz']

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, x to zz
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [7]:
df.describe()

               A          B          C
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [8]:
df.nunique()

A    4
B    4
C    4
dtype: int64

In [9]:
df.shape

(4, 3)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, x to zz
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [11]:
df.size

12

# Load DataFrames

In [12]:
coffee = pd.read_csv("https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/warmup-data/coffee.csv")
results = pd.read_parquet('results.parquet')
bios = pd.read_csv('bios.csv')

# Accessing Data with Pandas

In [13]:
coffee.head(10)

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30
8     Friday    Espresso          45
9     Friday       Latte          35

In [14]:
coffee.tail(10)

          Day Coffee Type  Units Sold
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [15]:
coffee.sample(10, random_state=1)

          Day Coffee Type  Units Sold
3     Tuesday       Latte          20
7    Thursday       Latte          30
6    Thursday    Espresso          40
2     Tuesday    Espresso          30
10   Saturday    Espresso          45
4   Wednesday    Espresso          35
1      Monday       Latte          15
12     Sunday    Espresso          45
0      Monday    Espresso          25
13     Sunday       Latte          35

## Accessing specific values from a dataframe

There are a couple of ways to do that, namely:
1. using `loc()` method 
2. using `iloc()` method
3. using `at` method
4. using `iat()` mathod

### loc property
Access a group of rows and columns by labels or a boolean array.<br>
`coffee[Rows, columns]`

In [16]:
coffee.loc[[0, 1, 5]]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
5  Wednesday       Latte          25

In [17]:
coffee.loc[5:7] # both the ends are included, unlike indexing in python

         Day Coffee Type  Units Sold
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30

In [18]:
coffee.loc[0:3, ["Day", 'Units Sold']]

       Day  Units Sold
0   Monday          25
1   Monday          15
2  Tuesday          30
3  Tuesday          20

### iloc
integer based location indexing 
`iloc[Rows, Columns]`

In [19]:
# iloc uses index location
coffee.iloc[0:3, [2]]

   Units Sold
0          25
1          15
2          30

### at
Access a single value. Use `at` if you only need to get or set a single value in a DataFrame or Series.<br>
`at[Row, Column`]

In [20]:
coffee.at[0, "Units Sold"], coffee.at[0, 'Day']

(np.int64(25), 'Monday')

### iat
Access a single value for a row/column pair by integer position

In [21]:
coffee.iat[1, 2], coffee.iat[2, 0]

(np.int64(15), 'Tuesday')

In [22]:
coffee.index = coffee["Day"]
coffee.head()

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35

In [23]:
coffee.loc["Monday":"Wednesday", "Units Sold"]

Day
Monday       25
Monday       15
Tuesday      30
Tuesday      20
Wednesday    35
Wednesday    25
Name: Units Sold, dtype: int64

In [ ]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          10
2    Tuesday    Espresso          10
3    Tuesday       Latte          10
4  Wednesday    Espresso          35

In [ ]:
coffee.at[0, "Units Sold"]

np.int64(25)

In [ ]:
coffee.iat[0,0]

'Monday'

In [ ]:
coffee.iloc[0,0]

'Monday'

In [ ]:
coffee["Day"]

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [ ]:
coffee.Day

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [ ]:
coffee["Units Sold"]

0     25
1     15
2     30
3     20
4     35
5     25
6     40
7     30
8     45
9     35
10    45
11    35
12    45
13    35
Name: Units Sold, dtype: int64

## Sort Data

In [ ]:
coffee.sort_values("Units Sold", ascending=False)

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [ ]:
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=False) 
# first sort by units sold
# then sort by coffee type

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
4   Wednesday    Espresso          35
7    Thursday       Latte          30
2     Tuesday    Espresso          30
5   Wednesday       Latte          25
0      Monday    Espresso          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [ ]:
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=[0, 1])
# dont make units sold ascending

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

## Iterate through a data frame (will lose some memory performance)

In [ ]:
# You should never modify something you are iterating over. 
# This is not guaranteed to work in all cases. 
# Depending on the data types, the iterator returns a copy 
# and not a view, and writing to it will have no effect.
for index, rows in coffee.iterrows():
    print(index)
    print(rows['Units Sold'])
    print("\n\n")

0
25



1
15



2
30



3
20



4
35



5
25



6
40



7
30



8
45



9
35



10
45



11
35



12
45



13
35

In [ ]:
for row in coffee.itertuples():
    print(row)

Pandas(Index=0, Day='Monday', _2='Espresso', _3=25)
Pandas(Index=1, Day='Monday', _2='Latte', _3=15)
Pandas(Index=2, Day='Tuesday', _2='Espresso', _3=30)
Pandas(Index=3, Day='Tuesday', _2='Latte', _3=20)
Pandas(Index=4, Day='Wednesday', _2='Espresso', _3=35)
Pandas(Index=5, Day='Wednesday', _2='Latte', _3=25)
Pandas(Index=6, Day='Thursday', _2='Espresso', _3=40)
Pandas(Index=7, Day='Thursday', _2='Latte', _3=30)
Pandas(Index=8, Day='Friday', _2='Espresso', _3=45)
Pandas(Index=9, Day='Friday', _2='Latte', _3=35)
Pandas(Index=10, Day='Saturday', _2='Espresso', _3=45)
Pandas(Index=11, Day='Saturday', _2='Latte', _3=35)
Pandas(Index=12, Day='Sunday', _2='Espresso', _3=45)
Pandas(Index=13, Day='Sunday', _2='Latte', _3=35)

# Filtering Data

In [30]:
bios.info()

bios.loc[bios['height_cm'] > 215, ['name', 'height_cm']]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jānis Krūmiņš      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vranković      217.0
7376      Eurelijus Žukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frédéric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueñas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Barać      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondřej Balvín      216.0
139365         Moustapha Fall      218.0

In [33]:
bios[bios['height_cm'] > 215][['name', 'height_cm']]

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jānis Krūmiņš      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vranković      217.0
7376      Eurelijus Žukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frédéric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueñas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Barać      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondřej Balvín      216.0
139365         Moustapha Fall      218.0

In [34]:
bios[(bios['height_cm'] > 215) & (bios['born_country'] == 'USA')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN

In [42]:
bios[bios['name'].str.contains('Keith|patrick', case=False, regex=True)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN
119,120,Patrick Wheatley,1899-01-20,Vryheid,KwaZulu-Natal,RSA,Great Britain,NaN,NaN,1967-11-05
319,320,Patrick De Koning,1961-04-23,Dendermonde,Oost-Vlaanderen,BEL,Belgium,178.0,92.0,NaN
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
2115,2125,Patrick Jopp,1962-01-08,NaN,NaN,NaN,Switzerland,176.0,67.0,NaN
...,...,...,...,...,...,...,...,...,...,...
143975,147633,Patrick Chinyemba,2001-01-03,NaN,NaN,NaN,Zambia,NaN,NaN,NaN
144172,147850,Patrick Jakob,1996-10-17,Sankt Johann in Tirol,Tirol,AUT,Austria,NaN,NaN,NaN
144547,148239,Patrick Galbraith,1986-03-11,Haderslev,Syddanmark,DEN,Denmark,NaN,NaN,NaN
144565,148257,Patrick Russell,1993-01-04,Gentofte,Hovedstaden,DEN,Denmark,186.0,93.0,NaN
145435,149158,Patrick Gasienica,1998-11-28,McHenry,Illinois,USA,United States,NaN,NaN,2023-06-12

In [56]:
bios[bios['born_country'].isin(['USA', 'FRA', 'GBR']) & (bios['name'].str.startswith('Dev'))]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
86828,87522,Dev Jennings,1924-06-28,Salt Lake City,Utah,USA,United States,180.0,78.0,2000-04-14
105304,106347,Devin Vargas,1981-12-25,Toledo,Ohio,USA,United States,190.0,91.0,NaN
126350,128702,Devin Logan,1993-02-17,Oceanside,New York,USA,United States,178.0,82.0,NaN
129512,132131,Devery Karz,1988-02-18,Park City,Utah,USA,United States,173.0,59.0,NaN
133304,136243,Devon Allen,1994-12-12,Phoenix,Arizona,USA,United States,185.0,84.0,NaN
133353,136292,Devin McEwan,1984-10-11,Sharon,Connecticut,USA,United States,178.0,77.0,NaN
143705,147360,Devin Booker,1996-10-30,Grand Rapids,Michigan,USA,United States,196.0,93.0,NaN

In [60]:
bios.query('born_country == "USA"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN
960,964,Xóchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN
961,965,Angélica Gavaldón,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN
...,...,...,...,...,...,...,...,...,...,...
145445,149168,Kristen Santos,1994-11-02,Fairfield,Connecticut,USA,United States,NaN,NaN,NaN
145446,149169,Corinne Stoddard,2001-08-15,Seattle,Washington,USA,United States,NaN,NaN,NaN
145454,149180,Anna Hoffmann,2000-03-28,Madison,Wisconsin,USA,United States,NaN,NaN,NaN
145457,149183,Alix Wilkinson,2000-08-02,Mammoth Lakes,California,USA,United States,NaN,NaN,NaN
145468,149195,Justin Abdelkader,1987-02-25,Muskegon,Michigan,USA,United States,187.0,97.0,NaN

# Query Function

The query method is super neat and is the pandas implementation of the `Find` function in `XRBID`.

In [ ]:
daoclean = pd.read_csv("/Users/undergradstudent/Research/XRB-Analysis/Galaxies/M66/Chandra-HST/M66_daoclean_matches.frame")

In [173]:
# Several use cases of the query method
daoclean.query('`F814W ID`.notnull()')
daoclean.query('`CSC ID` != "2CXO J112015.2+125932X" & `CSC ID` != "2CXO J112014.9+125928"')
daoclean.query('StarID != 1 & StarID != 2 & StarID != 5')
daoclean.query('`F814W ID`.isnull()')

,Unnamed: 0,X,Y,F555W ID,F275W ID,F336W ID,F438W ID,F814W ID,RA,Dec,CSC ID,StarID
2,2,3690.922608,5713.903685,18254,NaN,95118.0,34583.0,NaN,170.062890,12.991310,2CXO J112015.0+125928,1
3,3,3693.339708,5721.089782,18303,NaN,NaN,NaN,NaN,170.062862,12.991389,2CXO J112015.0+125928,2
4,4,3746.714500,5828.653600,19206,NaN,NaN,35989.0,NaN,170.062260,12.992573,2CXO J112014.9+125933,1
5,5,3743.843919,5833.507868,19247,130956.0,NaN,36055.0,NaN,170.062292,12.992626,2CXO J112014.9+125933,2
6,6,3631.498024,5707.196545,18194,NaN,NaN,NaN,NaN,170.063561,12.991236,2CXO J112015.2+125932X,1
...,...,...,...,...,...,...,...,...,...,...,...,...
253,253,2199.489446,7201.861053,31284,NaN,NaN,53854.0,NaN,170.079736,13.007685,2CXO J112019.0+130027,5
254,254,2219.766700,7203.825438,31301,NaN,135467.0,NaN,NaN,170.079507,13.007706,2CXO J112019.0+130027,6
255,255,2213.211646,7211.601845,31360,NaN,NaN,53928.0,NaN,170.079581,13.007792,2CXO J112019.0+130027,7
257,257,3768.771693,8363.063045,34886,203812.0,157738.0,59483.0,NaN,170.062011,13.020465,2CXO J112014.9+130113,1
260,260,3375.849092,2661.999469,1476,NaN,25753.0,NaN,NaN,170.066447,12.957722,2CXO J112015.9+125727,2

# Merging and Concatenating Data

In [235]:
import sys
sys.path.insert(0, '/Users/undergradstudent/Research/XRB-Analysis/Notebooks/')
from helpers.analysis import remove_unnamed
daoclean = remove_unnamed(pd.read_csv("/Users/undergradstudent/Research/XRB-Analysis/Galaxies/M66/Chandra-HST/M66_daoclean_matches.frame"))
M66_notes = remove_unnamed(pd.read_csv("/Users/undergradstudent/Research/XRB-Analysis/Galaxies/M66/Chandra-HST/M66_XRB_notes.txt"))

M66_notes contains all the XRB sources, their CSC IDs, their classification and the chosen best star. daoclean contains the CSC IDs, the filter IDs, the coordinates and the star ids. 

I will create a new frame from hmxbs with the classification HMXBs and then create a dataframe from the two which only contains the hmxbs.

In [ ]:
hmxbs = M66_notes.query('Class == "HMXB"').reset_index(drop=True)
hmxbs

,CSC ID,ID,Class,Best Star,Mass,Notes
0,2CXO J112014.9+125933,CXO003,HMXB,2.0,NaN,NaN
1,2CXO J112015.0+125936,CXO006,HMXB,1.0,NaN,NaN
2,2CXO J112015.0+125921,CXO007,HMXB,1.0,NaN,NaN
3,2CXO J112015.2+125921,CXO008,HMXB,2.0,NaN,NaN
4,2CXO J112014.7+125937,CXO009,HMXB,1.0,NaN,NaN
5,2CXO J112015.0+125938,CXO010,HMXB,1.0,NaN,NaN
6,2CXO J112015.3+125944,CXO014,HMXB,1.0,NaN,Should that be an HMXB?
7,2CXO J112013.5+125944,CXO019,HMXB,1.0,NaN,Probably ejected from the cluster 7924
8,2CXO J112012.8+125947,CXO022,HMXB,1.0,NaN,NaN
9,2CXO J112016.8+125959,CXO024,HMXB,3.0,NaN,A cluster is very nearby
10,2CXO J112018.8+125924,CXO035,HMXB,2.0,NaN,Very close to a stellar association and also a gc
11,2CXO J112013.7+130025,CXO036,HMXB,4.0,NaN,NaN
12,2CXO J112016.7+125830,CXO044,HMXB,1.0,NaN,NaN
13,2CXO J112019.5+125958,CXO047,HMXB,1.0,NaN,(1) Very near a globular cluster (2) Maybe ej...
14,2CXO J112019.0+130027,CXO051,HMXB,3.0,NaN,A very bright source not identified by my code
15,2CXO J112011.8+125811,CXO052,HMXB,1.0,NaN,NaN
16,2CXO J112014.9+130113,CXO057,HMXB,1.0,NaN,NaN
17,2CXO J112013.0+125736,CXO060,HMXB,1.0,NaN,NaN
18,2CXO J112015.9+125727,CXO061,HMXB,2.0,NaN,NaN

In [264]:
pd.merge(hmxbs, daoclean, left_on=['CSC ID', 'Best Star'], right_on=['CSC ID', 'StarID'], how='left')

,CSC ID,ID,Class,Best Star,Mass,Notes,X,Y,F555W ID,F275W ID,F336W ID,F438W ID,F814W ID,RA,Dec,StarID
0,2CXO J112014.9+125933,CXO003,HMXB,2.0,NaN,NaN,3743.843919,5833.507868,19247,130956.0,NaN,36055.0,NaN,170.062292,12.992626,2
1,2CXO J112015.0+125936,CXO006,HMXB,1.0,NaN,NaN,3700.317585,5908.701948,19792,NaN,NaN,36916.0,NaN,170.062784,12.993454,1
2,2CXO J112015.0+125921,CXO007,HMXB,1.0,NaN,NaN,3727.624318,5519.646556,16435,NaN,NaN,NaN,NaN,170.062475,12.989172,1
3,2CXO J112015.2+125921,CXO008,HMXB,2.0,NaN,NaN,3652.013236,5540.798551,16667,NaN,NaN,32346.0,NaN,170.063329,12.989405,2
4,2CXO J112014.7+125937,CXO009,HMXB,1.0,NaN,NaN,3834.343555,5918.287693,19852,NaN,NaN,37022.0,NaN,170.061270,12.993559,1
5,2CXO J112015.0+125938,CXO010,HMXB,1.0,NaN,NaN,3694.780748,5952.563551,20110,134991.0,NaN,NaN,NaN,170.062846,12.993936,1
6,2CXO J112015.3+125944,CXO014,HMXB,1.0,NaN,Should that be an HMXB?,3595.444164,6102.186159,21187,NaN,NaN,39199.0,20615.0,170.063968,12.995583,1
7,2CXO J112013.5+125944,CXO019,HMXB,1.0,NaN,Probably ejected from the cluster 7924,4265.222965,6110.760032,21250,140213.0,105316.0,NaN,20690.0,170.056403,12.995677,1
8,2CXO J112012.8+125947,CXO022,HMXB,1.0,NaN,NaN,4518.077121,6197.146311,21971,NaN,NaN,40508.0,21529.0,170.053547,12.996628,1
9,2CXO J112016.8+125959,CXO024,HMXB,3.0,NaN,A cluster is very nearby,3042.724778,6490.637342,24541,NaN,116238.0,44454.0,24097.0,170.070211,12.999858,3
10,2CXO J112018.8+125924,CXO035,HMXB,2.0,NaN,Very close to a stellar association and also a gc,2312.165203,5616.540985,17424,NaN,92649.0,33396.0,NaN,170.078462,12.990238,2
11,2CXO J112013.7+130025,CXO036,HMXB,4.0,NaN,NaN,4177.240381,7137.975463,30737,174040.0,133869.0,53074.0,29563.0,170.057397,13.006982,4
12,2CXO J112016.7+125830,CXO044,HMXB,1.0,NaN,NaN,3067.397243,4222.603316,5919,NaN,66663.0,16517.0,NaN,170.069932,12.974897,1
13,2CXO J112019.5+125958,CXO047,HMXB,1.0,NaN,(1) Very near a globular cluster (2) Maybe ej...,2033.527984,6447.470681,24140,NaN,114984.0,43873.0,23724.0,170.081610,12.999382,1
14,2CXO J112019.0+130027,CXO051,HMXB,3.0,NaN,A very bright source not identified by my code,2208.450122,7192.852518,31213,NaN,135197.0,53744.0,NaN,170.079635,13.007586,3
15,2CXO J112011.8+125811,CXO052,HMXB,1.0,NaN,NaN,4869.455824,3777.647306,3994,NaN,NaN,12079.0,3930.0,170.049579,12.970000,1
16,2CXO J112014.9+130113,CXO057,HMXB,1.0,NaN,NaN,3768.771693,8363.063045,34886,203812.0,157738.0,59483.0,NaN,170.062011,13.020465,1
17,2CXO J112013.0+125736,CXO060,HMXB,1.0,NaN,NaN,4463.710840,2888.783967,1804,48203.0,NaN,NaN,1718.0,170.054162,12.960218,1
18,2CXO J112015.9+125727,CXO061,HMXB,2.0,NaN,NaN,3375.849092,2661.999469,1476,NaN,25753.0,NaN,NaN,170.066447,12.957722,2

In [265]:
pd.merge(hmxbs, daoclean, left_on=['CSC ID', 'Best Star'], right_on=['CSC ID', 'StarID'], how='right')

,CSC ID,ID,Class,Best Star,Mass,Notes,X,Y,F555W ID,F275W ID,F336W ID,F438W ID,F814W ID,RA,Dec,StarID
0,2CXO J112014.9+125929,NaN,NaN,NaN,NaN,NaN,3728.392237,5731.691614,18393,NaN,95500.0,34799.0,17413.0,170.062466,12.991505,1
1,2CXO J112014.9+125929,NaN,NaN,NaN,NaN,NaN,3730.382900,5734.693669,18431,NaN,NaN,NaN,17413.0,170.062444,12.991539,2
2,2CXO J112015.0+125928,NaN,NaN,NaN,NaN,NaN,3690.922608,5713.903685,18254,NaN,95118.0,34583.0,NaN,170.062890,12.991310,1
3,2CXO J112015.0+125928,NaN,NaN,NaN,NaN,NaN,3693.339708,5721.089782,18303,NaN,NaN,NaN,NaN,170.062862,12.991389,2
4,2CXO J112014.9+125933,NaN,NaN,NaN,NaN,NaN,3746.714500,5828.653600,19206,NaN,NaN,35989.0,NaN,170.062260,12.992573,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
257,2CXO J112014.9+130113,CXO057,HMXB,1.0,NaN,NaN,3768.771693,8363.063045,34886,203812.0,157738.0,59483.0,NaN,170.062011,13.020465,1
258,2CXO J112013.0+125736,CXO060,HMXB,1.0,NaN,NaN,4463.710840,2888.783967,1804,48203.0,NaN,NaN,1718.0,170.054162,12.960218,1
259,2CXO J112015.9+125727,NaN,NaN,NaN,NaN,NaN,3375.849092,2661.999469,1476,NaN,25603.0,5443.0,1413.0,170.066447,12.957722,1
260,2CXO J112015.9+125727,CXO061,HMXB,2.0,NaN,NaN,3375.849092,2661.999469,1476,NaN,25753.0,NaN,NaN,170.066447,12.957722,2
261,2CXO J112018.9+130135,NaN,NaN,NaN,NaN,NaN,2253.377834,8911.615949,35145,NaN,162170.0,60333.0,33337.0,170.079129,13.026502,1

In [268]:
pd.merge(hmxbs, daoclean, left_on=['CSC ID', 'Best Star'], right_on=['CSC ID', 'StarID'], how='inner')

,CSC ID,ID,Class,Best Star,Mass,Notes,X,Y,F555W ID,F275W ID,F336W ID,F438W ID,F814W ID,RA,Dec,StarID
0,2CXO J112014.9+125933,CXO003,HMXB,2.0,NaN,NaN,3743.843919,5833.507868,19247,130956.0,NaN,36055.0,NaN,170.062292,12.992626,2
1,2CXO J112015.0+125936,CXO006,HMXB,1.0,NaN,NaN,3700.317585,5908.701948,19792,NaN,NaN,36916.0,NaN,170.062784,12.993454,1
2,2CXO J112015.0+125921,CXO007,HMXB,1.0,NaN,NaN,3727.624318,5519.646556,16435,NaN,NaN,NaN,NaN,170.062475,12.989172,1
3,2CXO J112015.2+125921,CXO008,HMXB,2.0,NaN,NaN,3652.013236,5540.798551,16667,NaN,NaN,32346.0,NaN,170.063329,12.989405,2
4,2CXO J112014.7+125937,CXO009,HMXB,1.0,NaN,NaN,3834.343555,5918.287693,19852,NaN,NaN,37022.0,NaN,170.061270,12.993559,1
5,2CXO J112015.0+125938,CXO010,HMXB,1.0,NaN,NaN,3694.780748,5952.563551,20110,134991.0,NaN,NaN,NaN,170.062846,12.993936,1
6,2CXO J112015.3+125944,CXO014,HMXB,1.0,NaN,Should that be an HMXB?,3595.444164,6102.186159,21187,NaN,NaN,39199.0,20615.0,170.063968,12.995583,1
7,2CXO J112013.5+125944,CXO019,HMXB,1.0,NaN,Probably ejected from the cluster 7924,4265.222965,6110.760032,21250,140213.0,105316.0,NaN,20690.0,170.056403,12.995677,1
8,2CXO J112012.8+125947,CXO022,HMXB,1.0,NaN,NaN,4518.077121,6197.146311,21971,NaN,NaN,40508.0,21529.0,170.053547,12.996628,1
9,2CXO J112016.8+125959,CXO024,HMXB,3.0,NaN,A cluster is very nearby,3042.724778,6490.637342,24541,NaN,116238.0,44454.0,24097.0,170.070211,12.999858,3
10,2CXO J112018.8+125924,CXO035,HMXB,2.0,NaN,Very close to a stellar association and also a gc,2312.165203,5616.540985,17424,NaN,92649.0,33396.0,NaN,170.078462,12.990238,2
11,2CXO J112013.7+130025,CXO036,HMXB,4.0,NaN,NaN,4177.240381,7137.975463,30737,174040.0,133869.0,53074.0,29563.0,170.057397,13.006982,4
12,2CXO J112016.7+125830,CXO044,HMXB,1.0,NaN,NaN,3067.397243,4222.603316,5919,NaN,66663.0,16517.0,NaN,170.069932,12.974897,1
13,2CXO J112019.5+125958,CXO047,HMXB,1.0,NaN,(1) Very near a globular cluster (2) Maybe ej...,2033.527984,6447.470681,24140,NaN,114984.0,43873.0,23724.0,170.081610,12.999382,1
14,2CXO J112019.0+130027,CXO051,HMXB,3.0,NaN,A very bright source not identified by my code,2208.450122,7192.852518,31213,NaN,135197.0,53744.0,NaN,170.079635,13.007586,3
15,2CXO J112011.8+125811,CXO052,HMXB,1.0,NaN,NaN,4869.455824,3777.647306,3994,NaN,NaN,12079.0,3930.0,170.049579,12.970000,1
16,2CXO J112014.9+130113,CXO057,HMXB,1.0,NaN,NaN,3768.771693,8363.063045,34886,203812.0,157738.0,59483.0,NaN,170.062011,13.020465,1
17,2CXO J112013.0+125736,CXO060,HMXB,1.0,NaN,NaN,4463.710840,2888.783967,1804,48203.0,NaN,NaN,1718.0,170.054162,12.960218,1
18,2CXO J112015.9+125727,CXO061,HMXB,2.0,NaN,NaN,3375.849092,2661.999469,1476,NaN,25753.0,NaN,NaN,170.066447,12.957722,2

In [267]:
pd.merge(hmxbs, daoclean, left_on=['CSC ID', 'Best Star'], right_on=['CSC ID', 'StarID'], how='outer')

,CSC ID,ID,Class,Best Star,Mass,Notes,X,Y,F555W ID,F275W ID,F336W ID,F438W ID,F814W ID,RA,Dec,StarID
0,2CXO J112011.8+125811,CXO052,HMXB,1.0,NaN,NaN,4869.455824,3777.647306,3994,NaN,NaN,12079.0,3930.0,170.049579,12.970000,1
1,2CXO J112012.8+125947,CXO022,HMXB,1.0,NaN,NaN,4518.077121,6197.146311,21971,NaN,NaN,40508.0,21529.0,170.053547,12.996628,1
2,2CXO J112013.0+125736,CXO060,HMXB,1.0,NaN,NaN,4463.710840,2888.783967,1804,48203.0,NaN,NaN,1718.0,170.054162,12.960218,1
3,2CXO J112013.2+130035,NaN,NaN,NaN,NaN,NaN,4368.456401,7391.815705,32720,NaN,139905.0,55752.0,NaN,170.055237,13.009776,1
4,2CXO J112013.2+130035,NaN,NaN,NaN,NaN,NaN,4360.122204,7393.958984,32731,NaN,139963.0,55760.0,NaN,170.055331,13.009800,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
257,2CXO J112019.5+125958,CXO047,HMXB,1.0,NaN,(1) Very near a globular cluster (2) Maybe ej...,2033.527984,6447.470681,24140,NaN,114984.0,43873.0,23724.0,170.081610,12.999382,1
258,2CXO J112019.5+125958,NaN,NaN,NaN,NaN,NaN,2050.820440,6449.156391,24147,NaN,115009.0,43885.0,23744.0,170.081415,12.999401,2
259,2CXO J112019.5+125958,NaN,NaN,NaN,NaN,NaN,2048.855626,6455.911540,24210,NaN,115223.0,43987.0,23799.0,170.081437,12.999475,3
260,2CXO J112019.5+125958,NaN,NaN,NaN,NaN,NaN,2061.746787,6459.672417,24236,NaN,115282.0,44027.0,NaN,170.081291,12.999516,4
261,2CXO J112019.5+125958,NaN,NaN,NaN,NaN,NaN,2049.129615,6464.583353,24275,NaN,NaN,44102.0,NaN,170.081434,12.999571,5